# MepUpperBottomElevation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MepUpperBottomElevation Property
ParameterTypeId Class See Also
---
"Upper End Bottom Elevation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MepUpperBottomElevation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MepUpperBottomElevation As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MepUpperBottomElevation {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace